app/views/paf_ecfs/_form.html.erb

SELECT "homologations".* FROM "homologations" ORDER BY titulo DESC
---
      <% end %>
      <br> <%= f.select :homologation_id, Homologation.all.order('titulo DESC').collect{|x| ["#{x.titulo} - #{x.compani.razaoSocial} (#{x.created_at.strftime("%d/%m/%Y")})" , x.id]} ,:prompt => "Selecione a homologação" %>