app/controllers/companis_controller.rb

SELECT "companis".* FROM "companis"
SELECT COUNT(*) FROM "companis"
---
  def index
    @companis = Compani.all
    @total = @companis.size

INSERT INTO "companis" ("razaoSocial", "nomeFantasia", "cnpj", "created_at", "updated_at", "endereco_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["razaoSocial", ""], ["nomeFantasia", ""], ["cnpj", ""], ["created_at", "2019-05-28 00:30:25.467690"], ["updated_at", "2019-05-28 00:30:25.467690"], ["endereco_id", 1]]
---
  def create
    @compani = Compani.new(compani_params)
    p "IMPRIMINDO O CNPJ"
    p @compani.cnpj
    if @compani.save

UPDATE "companis" SET "cnpj" = $1, "ie" = $2, "im" = $3, "updated_at" = $4 WHERE "companis"."id" = $5  [["cnpj", "1223456asdfs"], ["ie", ""], ["im", ""], ["updated_at", "2019-05-28 00:37:13.038344"], ["id", 2]]
---
  def update
    p "IMPRIMINDO O CNPJ"
    p @compani.cnpj
    if @compani.update(compani_params)

DELETE FROM "companis" WHERE "companis"."id" = $1  [["id", 1]]
---
  def destroy
    @compani.destroy

SELECT  "companis".* FROM "companis" WHERE "companis"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_compani
      @compani = Compani.find(params[:id])