app/controllers/controle_periodos_controller.rb

SELECT "controle_periodos".* FROM "controle_periodos" ORDER BY id desc
SELECT "controle_periodos".* FROM "controle_periodos"
SELECT COUNT(*) FROM "controle_periodos"
---
  def index
    @controle_periodos = ControlePeriodo.order("id desc")
    @total = @controle_periodos.size

INSERT INTO "controle_periodos" ("data", "matutinoInicial", "matutinoFinal", "vespertinoInicial", "vespertinoFinal", "noturnoInicial", "noturnoFinal", "homologation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @controle_periodo = ControlePeriodo.new(controle_periodo_params)

    if @controle_periodo.save

SELECT  "controle_periodos".* FROM "controle_periodos" WHERE "controle_periodos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_controle_periodo
      @controle_periodo = ControlePeriodo.find(params[:id])