app/controllers/enderecos_controller.rb

  def index
    @enderecos = Endereco.all
---
SELECT "enderecos".* FROM "enderecos"

  def create
    @endereco = Endereco.new(endereco_params)

    respond_to do |format|
      if @endereco.save
---
INSERT INTO "enderecos" ("rua", "bairro", "cidade", "estado", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rua", "a"], ["bairro", "b"], ["cidade", "c"], ["estado", "df"], ["created_at", "2019-05-21 14:40:21.158834"], ["updated_at", "2019-05-21 14:40:21.158834"]]

    def set_endereco
      @endereco = Endereco.find(params[:id])
---
SELECT  "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]