app/controllers/homologations_controller.rb

SELECT "homologations".* FROM "homologations" ORDER BY id DESC
SELECT "homologations".* FROM "homologations"
SELECT COUNT(*) FROM "homologations"
---
  def index
    @homologations = Homologation.order("id DESC")
    @total = @homologations.size

INSERT INTO "homologations" ("titulo", "compani_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["titulo", "teste"], ["compani_id", 1], ["created_at", "2019-05-27 11:45:58.285122"], ["updated_at", "2019-05-27 11:45:58.285122"]]
---
  def create
    @homologation = Homologation.new(homologation_params)

    if @homologation.save

SELECT  "homologations".* FROM "homologations" WHERE "homologations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_homologation
      @homologation = Homologation.find(params[:id])