app/controllers/material_recursos_controller.rb

SELECT "material_recursos".* FROM "material_recursos"
---
  def index
    @material_recursos = MaterialRecurso.all

INSERT INTO "material_recursos" ("nomeEquipamento", "marca", "modelo", "paf_ecf_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @material_recurso = MaterialRecurso.new(material_recurso_params)

    respond_to do |format|
      if @material_recurso.save

SELECT  "material_recursos".* FROM "material_recursos" WHERE "material_recursos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_material_recurso
      @material_recurso = MaterialRecurso.find(params[:id])