app/controllers/paf_ecfs_controller.rb

SELECT "paf_ecfs".* FROM "paf_ecfs"
SELECT COUNT(*) FROM "paf_ecfs"
---
  def index
    @paf_ecfs = PafEcf.all
    @total = @paf_ecfs.size

INSERT INTO "paf_ecfs" ("nome_comercial", "idetificacao_versao", "identificacao_executavel_principal", "linguagem", "gerenciador_db", "tipo_desenvolvimento", "integracao_paf", "tratamento_interrupcao", "created_at", "updated_at", "arquivo_sintegra", "homologation_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @paf_ecf = PafEcf.new(paf_ecf_params)
    if @paf_ecf.save

UPDATE "paf_ecfs" SET "idetificacao_versao" = $1, "identificacao_executavel_principal" = $2, "linguagem" = $3, "x_linux" = $4, "updated_at" = $5 WHERE "paf_ecfs"."id" = $6  [["idetificacao_versao", "asdfghjklç"], ["identificacao_executavel_principal", "asdfghjk"], ["linguagem", "asdfghjkl"], ["x_linux", "t"], ["updated_at", "2019-06-11 00:47:43.209708"], ["id", 2]]
---
  def update
    if @paf_ecf.update(paf_ecf_params)

DELETE FROM "paf_ecfs" WHERE "paf_ecfs"."id" = $1  [["id", 1]]
---
  def destroy
    @paf_ecf.destroy

SELECT  "paf_ecfs".* FROM "paf_ecfs" WHERE "paf_ecfs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_paf_ecf
      @paf_ecf = PafEcf.find(params[:id])