app/controllers/pdf_controller.rb

SELECT  "companis".* FROM "companis" WHERE "companis"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "homologations".* FROM "homologations" WHERE "homologations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "controle_periodos".* FROM "controle_periodos" WHERE "controle_periodos"."homologation_id" = $1 ORDER BY created_at ASC  [["homologation_id", 1]]
SELECT "representante_homologations".* FROM "representante_homologations" WHERE "representante_homologations"."homologation_id" = $1 ORDER BY created_at ASC  [["homologation_id", 1]]
SELECT  "paf_ecfs".* FROM "paf_ecfs" WHERE "paf_ecfs"."homologation_id" = $1 LIMIT $2  [["homologation_id", 1], ["LIMIT", 1]]
SELECT "material_recursos".* FROM "material_recursos" WHERE "material_recursos"."paf_ecf_id" = $1  [["paf_ecf_id", 2]]
---
  def certified
    @compani = Compani.find_by(id: params[:empresa])
    @homologation = Homologation.find_by(id: params[:homologation])
    @periodos = ControlePeriodo.where(homologation_id:  @homologation.id).order("created_at ASC")
    @representantes = RepresentanteHomologation.where(homologation_id:  @homologation.id).order("created_at ASC")
    @paf = PafEcf.find_by(homologation_id:  @homologation.id)
    @recursos = MaterialRecurso.where(paf_ecf_id:  @paf.id)