app/controllers/representantes_homologations_controller.rb

SELECT "representantes_homologations".* FROM "representantes_homologations"
---
  def index
    @representantes_homologations = RepresentantesHomologation.all

SELECT  "homologations".* FROM "homologations" WHERE "homologations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_representantes_homologation
      @representantes_homologation = RepresentantesHomologation.find(params[:id])