app/controllers/representante_empresas_controller.rb

  def index
    @representante_empresas = RepresentanteEmpresa.all
---
SELECT "representante_empresas".* FROM "representante_empresas"

  def create
    @representante_empresa = RepresentanteEmpresa.new(representante_empresa_params)

    respond_to do |format|
      if @representante_empresa.save
---
INSERT INTO "representante_empresas" ("nome", "funcao", "compani_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "JOANA"], ["funcao", "TESTE"], ["compani_id", 2], ["created_at", "2019-06-10 23:54:28.961180"], ["updated_at", "2019-06-10 23:54:28.961180"]]

    def set_representante_empresa
      @representante_empresa = RepresentanteEmpresa.find(params[:id])
---
SELECT  "representante_empresas".* FROM "representante_empresas" WHERE "representante_empresas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]