app/controllers/representante_homologations_controller.rb

SELECT "representante_homologations".* FROM "representante_homologations"
---
  def index
    @representante_homologations = RepresentanteHomologation.all

INSERT INTO "representante_homologations" ("homologation_id", "representante_empresa_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["homologation_id", 1], ["representante_empresa_id", 1], ["created_at", "2019-06-11 00:08:40.514866"], ["updated_at", "2019-06-11 00:08:40.514866"]]
---
  def create
    @representante_homologation = RepresentanteHomologation.new(representante_homologation_params)

    respond_to do |format|
      if @representante_homologation.save

SELECT  "homologations".* FROM "homologations" WHERE "homologations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "representante_homologations".* FROM "representante_homologations" WHERE "representante_homologations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_representante_homologation
      @representante_homologation = RepresentanteHomologation.find(params[:id])