app/views/material_recursos/_form.html.erb

      <% end %>
      <br> <%= f.select :paf_ecf_id, PafEcf.all.collect{|x| [x.nome_comercial, x.id]} ,:prompt => "Selecione o PAF" %>
---
SELECT "paf_ecfs".* FROM "paf_ecfs"