app/views/homologations/_form.html.erb

SELECT "companis".* FROM "companis"
---
        <% end %>
        <br> <%= f.select :compani_id, Compani.all.collect{|x| [x.razaoSocial, x.id]} ,:prompt => "Selecione a empresa" %>